import numpy as np

# 인덱싱, 슬라이싱 및 반복


a = np.arange(10)**3
print(a)
# # [  0   1   8  27  64 125 216 343 512 729]

print(a[2])
# # 8

print(a[2:5])
# # [ 8 27 64]

# # equivalent to a[0:6:2] = 1000;
# # from start to position 6, exclusive, set every 2nd element to 1000
a[:6:2] = 1000
print(a)
# [1000    1 1000   27 1000  125  216  343  512  729]

print(a[::-1])  # reversed a
# [ 729  512  343  216  125 1000   27 1000    1 1000]

for i in a:
    print(i**(1 / 3.))
# 9.999999999999998
# 1.0
# 9.999999999999998
# 3.0
# 9.999999999999998
# 5.0
# 5.999999999999999
# 6.999999999999999
# 7.999999999999999
# 8.999999999999998

















