import numpy as np
import numpy.random as rg

# 배열 모양 변경
# 렌덤함수를 사용해서 매번 결과값은 달라짐 변하는 형태만 보면됨
a = np.floor(10 * rg.random((3, 4)))
print(a)
# [[1. 6. 2. 0.]
#  [7. 8. 3. 1.]
#  [8. 7. 3. 8.]]
print(a.shape)
# (3, 4)
print(a.ravel()) 
# [1. 6. 2. 0. 7. 8. 3. 1. 8. 7. 3. 8.]
print(a.reshape(6, 2))  
# [[1. 6.]
#  [2. 0.]
#  [7. 8.]
#  [3. 1.]
#  [8. 7.]
#  [3. 8.]]
print(a.T)  
# [[1. 7. 8.]
#  [6. 8. 7.]
#  [2. 3. 3.]
#  [0. 1. 8.]]
print(a.T.shape)
# (4, 3)
print(a.shape)
# (3, 4)
print(a)
# [[1. 6. 2. 0.]
#  [7. 8. 3. 1.]
#  [8. 7. 3. 8.]]
a.resize((2, 6))

print(a)
# [[1. 6. 2. 0. 7. 8.]
#  [3. 1. 8. 7. 3. 8.]]
print(a.reshape(3, -1))
# [[1. 6. 2. 0.]
#  [7. 8. 3. 1.]
#  [8. 7. 3. 8.]]
