import numpy as np
import numpy.random as rg

# 하나의 배열을 여러 개의 작은 배열로 나누기


a = np.floor(10 * rg.random((2, 12)))
print(a)
# [[2. 6. 9. 8. 5. 1. 3. 9. 7. 6. 0. 0.]
#  [7. 2. 8. 4. 0. 9. 1. 7. 7. 1. 4. 1.]]

# 'a'를 3으로 분할
print(np.hsplit(a, 3))
# [array([[2., 6., 9., 8.],
#        [7., 2., 8., 4.]]), array([[5., 1., 3., 9.],
#        [0., 9., 1., 7.]]), array([[7., 6., 0., 0.],
#        [7., 1., 4., 1.]])]

# 세 번째와 네 번째 열 뒤의 'a'분할
print(np.hsplit(a, (3, 4)))
# [array([[2., 6., 9.],
#        [7., 2., 8.]]), array([[8.],
#        [4.]]), array([[5., 1., 3., 9., 7., 6., 0., 0.],
#        [0., 9., 1., 7., 7., 1., 4., 1.]])]

